{
  "types": [
    {
      "name": "Web development",
      "skills": [
        {
          "name": "React",
          "skillLevel": 3,
          "description": "I have a few years' experience using React in my own projects to produce responsive, modern web apps. It is mostly self-taught through a book and some YouTube tutorials. I have never used it in a production environment but feel confident I could productionise my code."
        },
        {
          "name": "Next JS",
          "skillLevel": 3,
          "description": "Along with React JS, I have used Next JS as the full-stack solution for a number of my personal projects. I love the performance and simplicity of Next JS and it has become a core part of my tech stack for any new web-based projects."
        },
        {
          "name": "CSS",
          "skillLevel": 4,
          "description": "While I am more comfortable with the back-end, I have been learning CSS and UI principles with a view of becoming a full-stack developer in the future. I'm confident using flex boxes, animations and media queries to create responsive websites."
        },
        {
          "name": "HTML",
          "skillLevel": 5,
          "description": "HTML underpins the front-end and can offer simple solutions to many formatting and usability dilemmas. I have been working with HTML5 for years and am very comfortable using it."
        },
        {
          "name": "PHP",
          "skillLevel": 3,
          "description": "While I prefer JavaScript-based web apps, I have had some experience in industry creating a supplier invoice portal from scratch in PHP and can use it if needed. I may need some training on best practices to use it in a larger scale application."
        }
      ]
    },
    {
      "name": "Programming languages",
      "skills": [
        {
          "name": "Python",
          "skillLevel": 4,
          "description": "I have experience using Python for data manipulation and web backends and understand both procedural and object-oriented paradigms. I have particular experience in the Pandas, SciKit-Learn and Flask."
        },
        {
          "name": "JavaScript",
          "skillLevel": 5,
          "description": "I have the most experience with JavaScript, and have used it primarily with Node JS for to build API servers. I have successfully integrated weighing scales in a factory and built many web apps with JavaScript and am very comfortable with ES6 and best practices."
        },
        {
          "name": "TypeScript",
          "skillLevel": 3,
          "description": "Having recognised some of the weaknesses of JavaScript's type system, I taught myself TypeScript to build more robust production apps. I have built a couple of side projects in this way and find it really enjoyable and worth the time investment."
        },
        {
          "name": "C#",
          "skillLevel": 3,
          "description": "C# was one of the first languages I learnt and I enjoy using it for little side projects, but I haven't used it in any large project or productionised any C# code."
        },
        {
          "name": "Haskell",
          "skillLevel": 2,
          "description": "I have learnt Haskell as part of a functional programming course at university and love its type system and focus on batch-processing."
        }
      ]
    },
    {
      "name": "Databases and reporting",
      "skills": [
        {
          "name": "SQL",
          "skillLevel": 5,
          "description": "I've used SQL consistently for a few years and thoroughly enjoy writing and optimising queries for BI reporting. I've worked with all the major RDBMSs and am comfortable with Microsoft SQL Server, PostgreSQL, MySQL and Oracle syntax."
        },
        {
          "name": "MongoDB",
          "skillLevel": 3,
          "description": "I've used MongoDB in one of my side-projects to store and query geospatial data. I found understanding NoSQL and its use cases very interesting and can definitely see myself using it in future projects if a non-relational use case arises."
        },
        {
          "name": "ETL",
          "skillLevel": 3,
          "description": "When building reports for clients, I'd often have to consider the technical architecture of their databases to ensure that the desired reports were possible and performant. This involved using ETL tools such as Power BI dataflows to perform ETL and ensure the data was in the correct format to report on."
        },
        {
          "name": "Power BI",
          "skillLevel": 5,
          "description": "I became very fluent in using Power BI and the DAX query language to visualise data, present insights and create professional reports. I also headed a training programme and helped other clients learn SQL and design Power BI reports."
        }
      ]
    },
    {
      "name": "Low-code app development",
      "skills": [
        {
          "name": "Power Apps",
          "skillLevel": 4,
          "description": "To offer useful and cost-effective solutions to smaller clients, I would use Power Apps to create fully validated apps for data manipulation in databases. This included an app currently used on the factory floor to replace paper production sheets and calculate machine throughput and efficiency."
        }
      ]
    }
  ]
}
